{
    "callForPapers": {
        "deadline": "2017-07-25", 
        "notification": "2017-07-28", 
        "url": "https://goo.gl/forms/wTyrVgyrOigZ5b2E3"
    }, 
    "city": "Novo Hamburgo", 
    "date": "2017-08-12", 
    "enrollment": {
        "availability": 250, 
        "closed": false, 
        "deadline": "2017-08-11", 
        "start": "2017-07-01", 
        "url": "https://goo.gl/forms/UZg3GSt31G7tP5SD3"
    }, 
    "id": "nh", 
    "institution": {
        "address": "Rua Silveira Martins, 780 ", 
        "courses": [
            {
                "name": "Análise e Desenvolvimento de Sistemas", 
                "url": "https://www.ftec.com.br/graduacao/curso/Analise-e-Desenvolvimento-de-Sistemas"
            }
        ], 
        "latitude": -29.681352, 
        "logo": "ftec.png", 
        "long_name": "FTEC Faculdades de Tecnologia", 
        "longitude": -51.125599, 
        "short_name": "FTEC", 
        "url": "http://www.ftec.com.br"
    }, 
    "rooms": [
        {
            "number": "Sala 1", 
            "subject": ""
        }, 
        {
            "number": "Sala 2", 
            "subject": ""
        }, 
        {
            "number": "Sala 3", 
            "subject": ""
        }
    ], 
    "schedule": {
        "08:30": [
            {
                "abstract": "", 
                "author": "", 
                "keywords": "credenciamento", 
                "level": "", 
                "resume": "", 
                "room": "", 
                "title": "Credenciamento"
            }
        ], 
        "09:00": [
            {
                "abstract": "", 
                "author": "Leonardo Vaz", 
                "keywords": "abertura", 
                "level": "", 
                "resume": "", 
                "room": "", 
                "title": "Abertura"
            }
        ], 
        "09:30": [
            {
                "abstract": "apresentação do qemu/kvm e demostração do virt-manager", 
                "author": "Daniel Lara", 
                "keywords": "linux , virtualização ", 
                "level": "Principiante", 
                "resume": "Sysadmin ,usário de GNU/Linux a 12 anos, Embaixador do Projeto Fedora no Brasil, Coordenador do time de tradução do pt_BR do fedora, Empacotador do Fedora, Faz parte da Equipe de moderadores do Viva o Linux, e tem vida social.  ", 
                "room": "1", 
                "title": "Virtualização para Usuários "
            }, 
            {
                "abstract": "        Esta Palestra tem como objetivo mostrar a instalação e configuração Raspberry pi – Linux Jessie – MINI. Este sistema faz com que seja o Kernel do Linux utilizado para sua funcionalidade  com este tipo hardware que é um “mini computador”.  Aqui vamos conhecer  uma instalação do \"SO\" estudar outros tipos  de modelos compatíveis e seus softwares respectivamente.", 
                "author": "Ercio Luis Dorneles Berna", 
                "keywords": "Raspberry pi", 
                "level": "Principiante", 
                "resume": "Profissional na área de T.I e Analista de Infraestrutura - Entusiasta Linux, Professor Educador, formado em Licenciatura em computação 2009/1 Universidade Feevale. Desenvolve projetos de Data center em Linux, com Centos ou Ubuntu Server desde 2009, experiência com Linux 7 anos, Experiencia com Raspberry Pi. Palestrante em eventos Festival Latino Americano de Software Livre - Feevale - NH.- RS -Tche Linux - Ftec NH-RS  - Fils 17 - PUC – ASL -Porto Alegre - RS e outros. Autor de Livro de Linux.", 
                "room": "2", 
                "title": "Instalação e configuração do Raspberry pi - Uso de software Livre Debian Jessie 8."
            }, 
            {
                "abstract": "Uma palestra de provocação para que a platéia pense sobre como ensinamos software hoje e como deveríamos estar ensinando amanhã, se quisermos que mais pessoas se interessem por programação (e porque isso é importante para o futuro).", 
                "author": "Luiz Fernando Duarte Junior", 
                "keywords": "Node.js", 
                "level": "Principiante", 
                "resume": "Luiz Fernando Duarte Junior é graduado em Ciência da Computação e pós-graduado em Computação Móvel. Empreendedor, autor de livros de programação e professor do ensino superior, trabalha há 11 anos com programação nas mais variadas plataformas e tecnologias e atualmente é evangelista técnico na Umbler.", 
                "room": "3", 
                "title": "Por que Stanford trocou Java por Node.js?"
            }
        ], 
        "10:30": [
            {
                "abstract": "Mostrar que PHP, uma das linguagens mais utilizada na Web também pode ser usada para comunicação com dispositivos. Nesta apresentação é mostrado o quadricóptero AR Drone e suas funcionalidades e possíveis formas de controlá-lo. Será dada uma breve introdução sobre a biblioteca ReactPHP, que possibilita desenvolver com PHP assíncrono e alguns projetos baseados na mesma. Também como é possível controlar um AR Drone utilizando o projeto PHP-ARDrone desenvolvido com base na biblioteca ReactPHP, e será demonstrado o drone sendo controlado através de scripts PHP, tando programando para que o drone seja autônomo quanto com interação em tempo real. ", 
                "author": "Fernando Silva", 
                "keywords": "php, drone, ReactPHP", 
                "level": "Intermediario", 
                "resume": "Analista de Desenvolvimento na KingHost, graduado em Análise e Desenvolvimento de Sistemas (ADS) pela Faculdade Senac Porto Alegre, onde ganhou o Prêmio Keller de melhor trajetória acadêmica. Atualmente faz pós-graduação em Segurança Cibernética pela UFGRS, além disso, é um dos coordenadores da comunidade PHP-RS, é entusiasta Open Source e Software Livre.", 
                "room": "2", 
                "title": "Controlando AR Drone com PHP"
            }, 
            {
                "abstract": "O tema Computação em Nuvem é vastamente usado nos dias de hoje, todavia se trata de um conceito um tanto abstrato para muitas pessoas. Nesta apresentação serão abordados os principais componentes de soluções de Computação em Nuvem, conceitos básicos como IaaS, PaaS e SaaS, e também os principais projetos de Open Source Cloud como Openstack, Openshift entre outros. ", 
                "author": "Leonardo Vaz", 
                "keywords": "Cloud, PaaS, IaaS, SaaS", 
                "level": "Principiante", 
                "resume": "Leonardo Vaz teve seu primeiro contato com o Software Livre no final de 1998, quando instalou o Red Hat Linux 5.1 no seu antigo PC, e no últimos 19 anos tem participado da comunidade Brasileira. Atualmente trabalha com Sistemas de Arquivos Distribuídos no time de Engenharia de Suporte da Red Hat. ", 
                "room": "1", 
                "title": "Tudo o que você sempre quis saber sobre Open Source Cloud Computing, mas tinha medo de perguntar!"
            }, 
            {
                "abstract": "Um problema comum aos que estão iniciando suas contribuição a projetos de software livre é o fato destes na maior parte do tempo possuirem o código armazenado em repositórios git. O git é um sistema de controle de revisionamento notoriamente não muito amigável. Nesta palestra vou dar uma visão geral dos comandos do git e como não utilizar o método XKCD (https://xkcd.com/1597/). Também quero falar brevemente sobre como usar as ferramentas do Github para um melhor trabalho colaborativo.", 
                "author": "Fabio Utzig", 
                "keywords": "git opensource vcs", 
                "level": "Intermediario", 
                "resume": "Fabio Utzig é desenvolvedor de software a 15 anos, atua primariamente na área de sistemas embarcados, é um dos mantenedores do sistema operacional de código aberto para microcontroladores ChibiOS/RT desde 2011, atualmente trabalhando para a empresa americana Runtime.io no desenvolvimento do sistema operacional para IoT Apache Mynewt e do bootloader para microcontroladores mcuboot.", 
                "room": "3", 
                "title": "Usando git eficientemente"
            }
        ], 
        "11:30": [
            {
                "abstract": "", 
                "author": "", 
                "keywords": "intervalo", 
                "level": "", 
                "resume": "", 
                "room": "", 
                "title": "Intervalo de Almoço"
            }
        ], 
        "13:00": [
            {
                "abstract": "Escrever testes é uma prática comum no desenvolvimento de software. Mas estamos escrevendo testes de forma errada. E eu vou explicar o que há de errado na forma de ver unit testes hoje em dia.", 
                "author": "Julio Biason", 
                "keywords": "unit test, testes, desenvolvimento", 
                "level": "Intermediario", 
                "resume": "Julio programa desde os 12 e descobriu a eficácia dos testes em 2007. Desde então tem procurado aprender a forma correta de se escrever testes.", 
                "room": "3", 
                "title": "O \"Unit\" de \"Unit tests\""
            }, 
            {
                "abstract": "Nesta palestra, será realizada uma introdução à programação com a biblioteca OpenCV, utilizando a linguagem de programação Python. Serão estudados diversos exemplos, até que seja construída uma aplicação para reconhecimento de faces em vídeo.", 
                "author": "Rafael Guterres Jeffman", 
                "keywords": "OpenCV, Python ", 
                "level": "Intermediario", 
                "resume": "Professor das disciplinas de algoritmos na Faculdade SENAC Porto Alegre, mestre em Computação Aplicada pela Unisinos,  fotógrafo e desenevolvedor, está envolvido com software livre desde o século passado (1998) e ajuda na coordenação e organização do TcheLinux desde seu retorno no evento do IPA em 2006.", 
                "room": "2", 
                "title": "Visão computacional com OpenCV"
            }, 
            {
                "abstract": "Esta palestra busca apresentar, para quem tem pressa, como utilizar os recursos mais elementares das expressões regulares e sua aplicação.", 
                "author": "João Avelino Bellomo Filho", 
                "keywords": "sed,regex,grep,shell", 
                "level": "Principiante", 
                "resume": "Tecnólogo em Processamento de Dados pela UCPel, Mestre em Ciência da Computação pela UFRGS. Ministrou aulas na UCPel e Faculdade SENAC Porto Alegre. Atualmente é Software Maintenance Engineer na Red Hat especializado em redes.", 
                "room": "1", 
                "title": "Expressões Regulares"
            }
        ], 
        "14:00": [
            {
                "abstract": "Voltada para todos os tipos de público, é uma apresentação / comparação sobre as tecnologias atuais em relação às disponíveis há 10 ou 15 anos atrás. Distribuições de Software, configuração de hardware, programas, redes sociais: o quanto isso pode mudar em 15 anos? ", 
                "author": "Fabio Beneditto", 
                "keywords": "tecnologia, linux", 
                "level": "Principiante", 
                "resume": "Entusiasta de Software Livre desde 1999, graduado em Sistemas para Internet na Feevale, Desenvolvedor Web, voluntário no SUMO (Suporte Mozilla). Defende o uso de padrões abertos na Internet. Aprecia muito PHP e JavaScript, assim como Postgresql.", 
                "room": "2", 
                "title": "...porque no MEU TEMPO: Comparativo entre algumas tecnologias atuais com 10+ anos atrás"
            }, 
            {
                "abstract": "Nesta apresentação será demonstrada soluções e tecnologias utilizadas para desenvolver um mecanismo de busca, focado em disponibilizar uma ferramenta que possibilite indexar uma grande quantidade de dados e a realização de busca otimizada dos mesmos. Para isso será abordado conceitos como Web Crawler, armazenamento de dados em banco não relacional utilizando Elasticsearch, e como tudo isso pode ser desenvolvido utilizando PHP. Também será abordado como ferramentas open source como Elasticsearch ou ainda toda stack Elastic podem ajudar e facilitar no desenvolvimento de soluções, utilizando qualquer linguagem de programação, como neste caso PHP.", 
                "author": "Fernando Silva", 
                "keywords": "php, Elasticsearch, open source", 
                "level": "Intermediario", 
                "resume": "Analista de Desenvolvimento na KingHost, graduado em Análise e Desenvolvimento de Sistemas (ADS) pela Faculdade Senac Porto Alegre, onde ganhou o Prêmio Keller de melhor trajetória acadêmica. Atualmente faz pós-graduação em Segurança Cibernética pela UFGRS, além disso, é um dos coordenadores da comunidade PHP-RS, é entusiasta Open Source e Software Livre.", 
                "room": "3", 
                "title": "Desenvolvendo um buscador com PHP e Elasticsearch "
            }, 
            {
                "abstract": "Ceph é um sistema de arquivos distribuído projetado para ter excelente desempenho, confiabilidade e escalabilidade. Nesta palestra será abordada a arquitetura do Ceph e também seus principais casos de uso. ", 
                "author": "Leonardo Vaz", 
                "keywords": "Ceph, Software Defined Storage", 
                "level": "Intermediario", 
                "resume": "Leonardo Vaz teve seu primeiro contato com o Software Livre no final de 1998, quando instalou o Red Hat Linux 5.1 no seu antigo PC, e no últimos 19 anos tem participado da comunidade Brasileira. Atualmente trabalha com Sistemas de Arquivos Distribuídos no time de Engenharia de Suporte da Red Hat. ", 
                "room": "1", 
                "title": "Introdução ao Ceph "
            }
        ], 
        "15:00": [
            {
                "abstract": "", 
                "author": "", 
                "keywords": "intervalo", 
                "level": "", 
                "resume": "", 
                "room": "", 
                "title": "Coffe-Break"
            }
        ], 
        "15:30": [
            {
                "abstract": "O objetivo da palestra é expor os benefícios e aplicabilidades do uso do Samba4, um conjunto de protocolos que cria um sistema de gerenciamento de identidade e segurança para domínios, totalmente livre e gratuita e pode ser instalada em qualquer distribuição Linux. Permite criar redes com gerenciamento centralizado semelhante as redes Windows com Active Directory.", 
                "author": "Eduardo Mozart de Oliveira", 
                "keywords": "Active Directory, Samba4, DNS, Kerberos, Winbind", 
                "level": "Intermediario", 
                "resume": "Analista de Suporte Técnico na Prefeitura Municipal de São Leopoldo/Secretaria Municipal de Educação (SMED). Atuou como Administrador de sistemas no 16º Grupo de Artilharia de Campanha Autopropulsado de São Leopoldo, administrando 119 computadores em uma estrutura Active Directory implementada com Samba4. Colaborador do projeto CID, que visa desenvolver interface gráfica para estações ingressarem a domínios Active Directory. Cursando Gestão da Tecnologia da Informação na IERGS e Técnico em Informática pela IENH. Cursos de extensão realizados na área: Administração de Servidores Linux I, II e III com Marcelo Dieder, Administrador de Redes Linux e Administrador de Redes Windows I e II (Informatize) e Linux - Serviços de Segurança pelo 1º Centro de Telemática de Área (Exército Brasileiro).  ", 
                "room": "1", 
                "title": "Samba4 - Uma alternativa opensource ao Active Directory"
            }, 
            {
                "abstract": "Docker tem se tornado uma tecnologia padrão para times ágeis, facilitando cada vez mais a entrega de novos produtos ou features. Com ele é possível melhorar seus processos de deploy, através dessa apresentação poderemos entender como é possível utilizar o Docker Swarm para gerenciar suas aplicações, e principalmente, como realizar um processo de deploy com maior segurança e qualidade.", 
                "author": "Cristiano dos Santos Diedrich", 
                "keywords": "Docker, Deploy, Docker Swarm, Deployment, Blue-Green Deployment", 
                "level": "Intermediario", 
                "resume": "Formado em sistemas de informação, trabalho atualmente como container specialyst na Umbler, uma startup de hosting sob demanda, atuo na pesquisa e desenvolvimento de soluções para hosting e PaaS. Sou apaixonado por linux e tecnologias open-source, áreas que conheço a mais de 10 anos.", 
                "room": "3", 
                "title": "Blue-Green Deployment with Docker Swarm"
            }, 
            {
                "abstract": "Porque faz sentido ajudar em projetos open source e como começar a participar", 
                "author": "Julio Biason", 
                "keywords": "cooperação, open source, ", 
                "level": "Principiante", 
                "resume": "Julio Biason foi apresentado ao mundo do open source em 2000 e desde então tem participado como pode de vários projetos.", 
                "room": "2", 
                "title": "Por que e Como Participar de Projetos Open Source"
            }
        ], 
        "16:30": [
            {
                "abstract": "", 
                "author": "Rafael Guterres Jeffman", 
                "keywords": "encerramento", 
                "level": "", 
                "resume": "", 
                "room": "", 
                "title": "Painel: Software Livre e o Mercado de Trabalho"
            }
        ]
    }, 
    "sponsors": [], 
    "support": []
}
